siredmar/master/Recherche/EA313x/lpc3xxx_cdl/csps/lpc313x/source/lpc313x_mci_driver.c
  if (pdev->status & MCI_INT_RTO)
  {
    uart_string_write("Unable to get card state \r\n");
    /* unable to get the card state. So return immediatly. */
    return _ERROR;
  }

  /* check card state in response */
  status = R1_CURRENT_STATE(pdev->response[0]);

  switch (status)
  {
    case SDMMC_STBY_ST:
      /* put card in 'Trans' state */
      //lock =1;
      mci_execute_command(pdev, CMD_SELECT_CARD, pdev->rca << 16, 0);

      if (pdev->status != 0)
      {
        uart_string_write("Unable to put the card in trans state \r\n");
        /* unable to put the card in Trans state. So return immediatly. */
        return _ERROR;
      }
      break;
    case SDMMC_TRAN_ST:
      /*do nothing */
      break;

    case SDMMC_PRG_ST:
    case SDMMC_RCV_ST:
      do
      {

//        uart_string_write("SDMMC_PRG_ST !! \r\n");
        /* get current state of the card */
        mci_execute_command(pdev, CMD_SEND_STATUS, pdev->rca << 16, 0);
        if (pdev->status & MCI_INT_RTO)
        {
          uart_string_write("Unable to get card state !! \r\n");
          /* unable to get the card state. So return immediatly. */
          return _ERROR;
        }

        /* check card state in response */
        status = R1_CURRENT_STATE(pdev->response[0]);
      }
      while (status != SDMMC_TRAN_ST);
      break;

    default:
      uart_string_write("Unknown state \r\n");
      /* card shouldn't be in other states so return */
      return _ERROR;
  }

#if defined (USE_WIDE)
  if (pdev->card_type & CARD_TYPE_SD)
  {
    mci_execute_command(pdev, CMD_SD_SET_WIDTH, 2, 0);  /* SD, 4 bit width */

    /* if positive response */
    MCI->ctype = MCI_CTYPE_4BIT;
  }
#endif
  MCI->blksiz = MMC_SECTOR_SIZE;

  mci_execute_command(pdev, CMD_SET_BLOCKLEN, MMC_SECTOR_SIZE, 0);

  return _NO_ERROR;
}

INT_32 mci_get_status(MCI_CARD_INFO_T* pdev)
{

  /* get current state of the card */

  mci_execute_command(pdev, CMD_SEND_STATUS, pdev->rca << 16, 0);
  return pdev->response[0];
}

#ifdef USE_DMA
/***********************************************************************
 *
 * Function: dma_callback
 *
 * Purpose: DMA handler callback
 *
 * Processing:
 *     The DMA callback sets the dmadone flag indicating to the
 *     application thread about the transfer completion
 *
 * Parameters:
 *    pdmaregs: Pointer to DMA registers
 *
 * Outputs: None
 *
 * Returns: Always returns 1
 *
 * Notes: None
 *
 **********************************************************************/
void dma_callback(INT_32 ch, DMA_IRQ_TYPE_T itype, void *pdmaregs)
{

  UNS_32 irqmask = dmaregs->irq_status_clear & (0x1 << (dmach * 2));

  dmaregs->irq_status_clear = irqmask;
  dmadone = 1;
}
#endif

#ifndef POLL
/***********************************************************************
 *
 * Function: mci_int_handler
 *
 * Purpose: General MCI interrupt handler and router
 *
 * Processing:
 *     Handles transmit, receive, and status interrupts for the UART.
 *     Based on the interrupt status, routes the interrupt to the
 *     respective callback to be handled by the user application using
 *     this driver.
 *
 * Parameters: None
 *
 * Outputs: None
 *
 * Returns: Nothing
 *
 * Notes: If a callback doesn't exist, the interrupt will be disabled.
 *
 **********************************************************************/
void mci_int_handler()
{
  MCI_CARD_INFO_T *psdcard = &g_card_info;
  unsigned int mintsts = MCI->mintsts;

  mintsts = MCI->mintsts;

  if (!mintsts) //spurious
    return;

  if (mintsts & MCI_INT_CD)
  {
    MCI->rintsts = MCI_INT_CD; //clear interrupt
  }

  if (mintsts & MCI_INT_CMD_DONE)
  {
    MCI->rintsts = MCI_INT_CMD_DONE; //clear interrupt
    switch (psdcard->cmd & CMD_MASK_RESP)
    {
      case 0:
        break;
      case CMD_RESP_R1:
      case CMD_RESP_R3:
        prv_pull_response(psdcard, 48);
        break;
      case CMD_RESP_R2:
        prv_pull_response(psdcard, 136);
        break;
    }

    lock = 0;
  }

  if (mintsts & MCI_INT_RXDR)
  {
    MCI->intmsk &= ~MCI_INT_RXDR;
    rxdr = 1;
  }

  if (mintsts & MCI_INT_DATA_OVER)
  {
    MCI->rintsts |= MCI_INT_DATA_OVER;
    dto = 1;
  }

  if (mintsts & MCI_INT_TXDR)
  {
    MCI->intmsk &= ~MCI_INT_TXDR;
    txdr = 1;
  }

  if (mintsts & MCI_INT_ERROR)
  {
    MCI->rintsts |= MCI_INT_ERROR; //clear interrupt
    psdcard->status = mintsts;

    if (mintsts & MCI_INT_HTO)
    {
      txdr = 1;
      rxdr = 1;
      psdcard->status = 0;
    }
    else
    {
      if (!(mintsts & MCI_INT_RTO))
      {
        sprintf(buff, "Error with transfer %x \r\n", mintsts);
        uart_string_write(buff);
      }
    }

  }

}
#endif

/***********************************************************************
 * MCI driver public functions
 **********************************************************************/

/***********************************************************************
 *
 * Function: mci_execute_command
 *
 * Purpose: Function to execute a command.
 *
 * Processing:
 *     Send the requested command to the card and retrieve the response.
 *
 * Parameters:
 *     pdev: Pointer to card info structure
 *     cmd  : Command with all flags set.
 *     arg  : Argument for the command
 *     wait_status  : Status bits to poll for command completion.
 *
 * Outputs: None
 *
 * Returns: Zero on success. Else returns the status register on error.
 *
 * Notes: None
 *
 **********************************************************************/
void mci_execute_command(MCI_CARD_INFO_T* pdev,
                         UNS_32 cmd,
                         UNS_32 arg,
                         UNS_32 wait_status)
{
  /* if APP command there are 2 stages */
  UNS_32 step = (cmd & CMD_BIT_APP) ? 2 : 1;
  UNS_32 cmd_reg = 0;

  pdev->cmd = cmd;

  if (!wait_status)
    wait_status = (cmd & CMD_MASK_RESP) ? MCI_INT_CMD_DONE : MCI_INT_DATA_OVER;

  /* Clear the interrupts & FIFOs*/
  if (cmd & CMD_BIT_DATA)
    prv_clear_all();

#ifndef POLL
  lock = 1;
#endif

  while (step)
  {
    prv_set_clock((cmd & CMD_BIT_LS) ? SD_MMC_ENUM_CLOCK : pdev->speed);

    /* Clear the interrupts */
    MCI->rintsts = 0xFFFFFFFF;

    switch (step)
    {
      case 1:     /* Execute command */
        cmd_reg = ((cmd & CMD_MASK_CMD) >> CMD_SHIFT_CMD)
                  | ((cmd & CMD_BIT_INIT)  ? MCI_CMD_INIT : 0)
                  | ((cmd & CMD_BIT_DATA)  ? (MCI_CMD_DAT_EXP | MCI_CMD_PRV_DAT_WAIT) : 0)
                  | (((cmd & CMD_MASK_RESP) == CMD_RESP_R2) ? MCI_CMD_RESP_LONG : 0)
                  | ((cmd & CMD_MASK_RESP) ? MCI_CMD_RESP_EXP : 0)
                  | ((cmd & CMD_BIT_WRITE)  ? MCI_CMD_DAT_WR : 0)
                  | ((cmd & CMD_BIT_STREAM) ? MCI_CMD_STRM_MODE : 0)
                  | ((cmd & CMD_BIT_BUSY) ? MCI_CMD_STOP : 0)
                  | ((cmd & CMD_BIT_AUTO_STOP)  ? MCI_CMD_SEND_STOP : 0)
                  //                | MCI_CMD_START
                  ;
        /* wait for previos data finsh for select/deselect commands */
        if (((cmd & CMD_MASK_CMD) >> CMD_SHIFT_CMD) == MMC_SELECT_CARD)
          cmd_reg |= MCI_CMD_PRV_DAT_WAIT;

        /* wait for command to be accepted by CIU */
        if (prv_send_cmd(cmd_reg, arg) == 0)
          --step;
        break;

      case 0:
        return;

      case 2:      /* APP prefix */
        cmd_reg = MMC_APP_CMD
                  | MCI_CMD_RESP_EXP /* Response is status */
                  | ((cmd & CMD_BIT_INIT)  ? MCI_CMD_INIT : 0)
                  | MCI_CMD_START
                  ;
        if (prv_send_cmd(cmd_reg, pdev->rca << 16) == 0)
          --step;
        break;
    }

#ifdef POLL
    /* wait for command response*/
    prv_wait_for_completion(pdev, wait_status);

    /* We return an error if there is a timeout, even if we've fetched
    a response */
    if (pdev->status & MCI_INT_ERROR)
      return;

