siredmar/master/Recherche/EA313x/lpc3xxx_cdl/csps/lpc313x/source/lpc313x_mci_driver.c
    if (pdev->status & MCI_INT_CMD_DONE)
    {
      switch (cmd & CMD_MASK_RESP)
      {
        case 0:
          break;
        case CMD_RESP_R1:
        case CMD_RESP_R3:
          prv_pull_response(pdev, 48);
          break;
        case CMD_RESP_R2:
          prv_pull_response(pdev, 136);
          break;
      }
    }
#endif

    pdev->status = 0;
  }

#ifndef POLL
  while (lock);
#endif

  return;
}


/***********************************************************************
 *
 * Function: mci_acquire
 *
 * Purpose: Function to enumerate the SD/MMC/SDHC/MMC+ cards.
 *
 * Processing:
 *     This function perform card identification process described in
 *  MMC 4.2 and SD 2.0 specification. The function uses "state" variable
 *  to track the identification process.
 *
 *  For SD/SDHC cards the "state" transitions from:
 *  0 -> 1 -> 2 -> 3 -> 4 -> 5 -> 6 -> 7
 *
 *  For MMC/ MMC+ cards the "state" transitions from:
 *  0 -> 1 -> 10 -> 11 -> 12 -> 13 -> 14 -> 15 -> 16 -> 17
 *
 * Parameters:
 *     devid: Pointer to card info structure
 *
 * Outputs: None
 *
 * Returns: None.
 *
 * Notes: None
 *
 **********************************************************************/
void mci_acquire(MCI_CARD_INFO_T* pdev)
{
  UNS_32 tries = 0;
  UNS_32 ocr = OCR_VOLTAGE_RANGE_MSK;
  UNS_32 r;
  INT_32 state = 0;
  UNS_32 command = 0;
  /* preserve wait_func */
  MCI_CMD_WAIT_FUNC_T temp = pdev->wait_func;

  /* clear card struct */
  memset(pdev, 0, sizeof(MCI_CARD_INFO_T));
  /* restore wait_func */
  pdev->wait_func = temp;

  /* clear card type */
  MCI->ctype = 0;

  /* set high speed for the card as 20MHz */
  pdev->speed = MMC_MAX_CLOCK;

  mci_execute_command(pdev, CMD_IDLE, 0, MCI_INT_CMD_DONE);

  while (state < 100)
  {
    switch (state)
    {
      case 0:     /* Setup for SD */
        /* check if it is SDHC card */

        mci_execute_command(pdev, CMD_SD_SEND_IF_COND, SD_SEND_IF_ARG, 0);
        if (!(pdev->status & MCI_INT_RTO))
        {
          /* check response has same echo pattern */
          if ((pdev->response[0] & SD_SEND_IF_ECHO_MSK) == SD_SEND_IF_RESP)
          {
            /* it is SD 2.0 card so indicate we are SDHC capable*/
            ocr |= OCR_HC_CCS;
          }
        }
        ++state;
        command = CMD_SD_OP_COND;
        tries = INIT_OP_RETRIES;
        /* assume SD card */
        pdev->card_type |= CARD_TYPE_SD;
        /* for SD cards high speed is 25MHz */
        pdev->speed = SD_MAX_CLOCK;

        break;

      case 10:      /* Setup for MMC */
        /* start fresh for MMC crds */
        pdev->card_type &= ~CARD_TYPE_SD;

        mci_execute_command(pdev, CMD_IDLE, 0, MCI_INT_CMD_DONE);
        command = CMD_MMC_OP_COND;
        tries = INIT_OP_RETRIES;
        ocr |= OCR_HC_CCS;
        ++state;

        /* for MMC cards high speed is 20MHz */
        pdev->speed = MMC_MAX_CLOCK;

        break;

      case 1:
      case 11:

        mci_execute_command(pdev, command, 0, 0);
        if (pdev->status & MCI_INT_RTO)
        {
          state += 9;		/* Mode unavailable */
          uart_string_write("Mode unavailable \r\n");
        }
        else
        {
          ++state;
        }
        timer_wait_ms(NULL, MS_ACQUIRE_DELAY);
        break;

      case 2:			/* Initial OCR check  */
      case 12:
        ocr = pdev->response[0] | (ocr & OCR_HC_CCS);
        if (ocr & OCR_ALL_READY)
        {
          state = 4; //temporary fix for some cards that wouldnt work without this.
        }
        else
        {
          state += 2;
        }
        break;

      case 3:			/* Initial wait for OCR clear */
      case 13:
        while ((ocr & OCR_ALL_READY) && --tries > 0)
        {
          timer_wait_ms(NULL, MS_ACQUIRE_DELAY);

          mci_execute_command(pdev, command, 0, 0);

          ocr = pdev->response[0] | (ocr & OCR_HC_CCS);
        }
        if (ocr & OCR_ALL_READY)
        {
          state += 7;
        }
        else
        {
          ++state;
        }

        break;

      case 14:
        /* for MMC cards set high capacity bit */
        ocr |= OCR_HC_CCS;
      case 4:     /* Assign OCR */
        tries = SET_OP_RETRIES;
        ocr &= OCR_VOLTAGE_RANGE_MSK | OCR_HC_CCS;	/* Mask for the bits we care about */
        do
        {
          timer_wait_ms(NULL, MS_ACQUIRE_DELAY);

          mci_execute_command(pdev, command, ocr, 0);

          r = pdev->response[0];
        }
        while (!(r & OCR_ALL_READY) && --tries > 0);
        if (r & OCR_ALL_READY)
        {
          /* is it high capacity card */
          pdev->card_type |= (r & OCR_HC_CCS);
          ++state;
        }
        else
        {
          state += 6;
        }

        break;

      case 5:     /* CID polling */
      case 15:
        mci_execute_command(pdev, CMD_ALL_SEND_CID, 0, 0);

        memcpy(pdev->cid, pdev->response, 16);
        ++state;

        break;

      case 6:     /* RCA send, for SD get RCA */
        mci_execute_command(pdev, CMD_SD_SEND_RCA, 0, 0);

        pdev->rca = (pdev->response[0]) >> 16;
        ++state;

        break;
      case 16:      /* RCA assignment for MMC set to 1 */
        pdev->rca = 1;
        mci_execute_command(pdev, CMD_MMC_SET_RCA, pdev->rca << 16, 0);

        ++state;

        break;

      case 7:
      case 17:
        mci_execute_command(pdev, CMD_SEND_CSD, pdev->rca << 16, 0);

        memcpy(pdev->csd, pdev->response, 16);
        state = 100;

        break;

      default:
        state += 100; /* break from while loop */
        break;
    }
  }
  if (prv_card_acquired(pdev))
  {
    /* change delay gates per card type */
    if (pdev->card_type & CARD_TYPE_SD)
      SYS_REGS->mci_delaymodes = SYS_REG_SD_CARD_DELAY;
    else
      SYS_REGS->mci_delaymodes = SYS_REG_MMC_CARD_DELAY;

