siredmar/master/Recherche/EA313x/lpc3xxx_cdl/csps/lpc313x/source/lpc313x_mci_driver.c
    /* now compute card size, block size and no. of blocks
    based on CSD response recived. */
    prv_process_csd(pdev);
  }
}

/***********************************************************************
 *
 * Function: mci_open
 *
 * Purpose: Opens the MCI card controller
 *
 * Processing:
 *     See function.
 *
 * Parameters:
 *     ipbase: Pointer to a MCI peripheral block
 *     arg   : Pointer to wait function to be used during for poll
 *             command status. Application with OS capabilities can use
 *             this option to avoid busy wait implemented in the driver's
 *             default wait routine.
 *
 * Outputs: None
 *
 * Returns: The pointer to a card info structure or NULL
 *
 * Notes: None
 *
 **********************************************************************/
INT_32 mci_open(void *ipbase, INT_32 arg)
{
  volatile UNS_32 i;
#ifdef USE_DMA
  static UNS_32 alloc;
#endif
  /* enable SD/MMC clock */
  cgu_clk_en_dis(CGU_SB_SD_MMC_HCLK_ID, 1);
  cgu_clk_en_dis(CGU_SB_SD_MMC_CCLK_IN_ID, 1);

  /* reset SD/MMC/MCI modules through CGU */
  /* reset SD/MMC/MCI modules through CGU */
  /* clear and set the register */
  CGU_CFG->sd_mmc_pnres_soft = 0;
  CGU_CFG->sd_mmc_nres_cclk_in_soft = 0;
  /* introduce some delay */
  for (i = 0;i < 1000;i++);
  CGU_CFG->sd_mmc_nres_cclk_in_soft = CGU_CONFIG_SOFT_RESET;
  CGU_CFG->sd_mmc_pnres_soft = CGU_CONFIG_SOFT_RESET;

  /* Set IOCONF to MCI pins */
  SYS_REGS->mci_delaymodes = 0;
  SYS_REGS->mux_gpio_mci_sel = 1;
  /* set the pins as driven by IP in IOCONF */
  IOCONF->block[IOCONF_MUX0].mode1_clear = 0xF0000003;
  IOCONF->block[IOCONF_MUX0].mode0_set = 0xF0000003;

  /* set delay gates */
  SYS_REGS->mci_delaymodes = SYS_REG_SD_CARD_DELAY;

  /* reset all blocks */
  MCI->ctrl = MCI_CTRL_RESET | MCI_CTRL_FIFO_RESET
              | MCI_CTRL_DMA_RESET;
  /* wait till resets clear */
  while (MCI->ctrl &
         (MCI_CTRL_RESET | MCI_CTRL_FIFO_RESET | MCI_CTRL_DMA_RESET));

  /* Clear the interrupts for the host controller */
  MCI->rintsts = 0xFFFFFFFF;

  /* Put in max timeout */
  MCI->tmout = 0xFFFFFFFF;

  /* FIFO threshold settings  */
#ifdef USE_DMA
  MCI->fifoth = (0x1 << 28) | (0xB << 16) | (0xC << 0); //DMA size = 4 : Burst transfers
#else
  MCI->fifoth = (0x2 << 28) | (0xF << 16) | (0x10 << 0);
#endif

  /* disable clock to CIU */
  MCI->clkena = 0;
  MCI->clksrc = 0;

  /* clear mmc structure*/
  memset(&g_card_info, 0, sizeof(MCI_CARD_INFO_T));
  /* set the wait_func if passed */
  g_card_info.wait_func = (MCI_CMD_WAIT_FUNC_T)arg;

#ifndef POLL
  /* Install MCI interrupt handler */
  int_install_irq_handler(IRQ_MCI, mci_int_handler);
  int_enable(IRQ_MCI);


  /* enable masked interrupts */
  MCI->intmsk = MCI_INT_CMD_DONE | MCI_INT_DATA_OVER | MCI_INT_TXDR | MCI_INT_RXDR | MCI_INT_CD | MCI_INT_ERROR;

  MCI->ctrl |= MCI_CTRL_INT_ENABLE;

#ifdef USE_DMA
  //initialize DMA controller
  dma_init();
  dmaregs = dma_get_base();
  if (!alloc)
  {
    dmach = dma_alloc_channel(-1, dma_callback, (void *)dmaregs);
    alloc = 1;
  }
  MCI->ctrl |= MCI_CTRL_DMA_ENABLE;
#endif


#endif

  /* start card enumeration if present */
  mci_acquire(&g_card_info);

  return ((INT_32)&g_card_info);
}

/***********************************************************************
 *
 * Function: mci_close
 *
 * Purpose: Close the MCI
 *
 * Processing:
 *     IResets MCI controller and disables clocks going to the MCI.
 *
 * Parameters:
 *     devid: Pointer to card info structure
 *
 * Outputs: None
 *
 * Returns: The status of the close operation
 *
 * Notes: None
 *
 **********************************************************************/
STATUS mci_close(INT_32 devid)
{
  /* clear mmc structure*/
  memset(&g_card_info, 0, sizeof(MCI_CARD_INFO_T));
  /* reset SD/MMC/MCI modules through CGU */
  cgu_soft_reset_module(SD_MMC_PNRES_SOFT);
  cgu_soft_reset_module(SD_MMC_NRES_CCLK_IN_SOFT);
  /* Turn off SD/MMC clocks */
  cgu_clk_en_dis(CGU_SB_SD_MMC_HCLK_ID, FALSE);
  cgu_clk_en_dis(CGU_SB_SD_MMC_CCLK_IN_ID, FALSE);
  /* Bakki: code to disable interrupt etc .. cleaning */
  return _NO_ERROR;
}


/***********************************************************************
 *
 * Function: mci_read_blocks
 *
 * Purpose: Performs the read of data from the SD/MMC card
 *
 * Processing:
 *     Reads the requested blocks in sequence.
 *
 * Parameters:
 *     devid:     Pointer to card info structure
 *     buffer:    Pointer to data buffer to copy to
 *     start_block: Start block number
 *     end_block: End block number
 *
 * Outputs: None
 *
 * Returns: Number of bytes actually read
 *
 * Notes:
 *  To read single block set start_block = end_block.
 *
 **********************************************************************/
INT_32 mci_read_blocks(INT_32 devid,
                       void* buffer,
                       INT_32 start_block,
                       INT_32 end_block)
{
  MCI_CARD_INFO_T* pdev = (MCI_CARD_INFO_T*) devid;
  INT_32 cbRead = (end_block - start_block) << 9; /*(end_block - start_block) * 512 */
  INT_32 index;
#ifndef USE_DMA
  UNS_32 Read = 0;
#endif

  /* if card is not acquired return immediately */
  if ((prv_card_acquired(pdev) == FALSE)
      || (end_block < start_block) /* check block index in range */
      || (start_block < 0)
      || (end_block > pdev->blocknr)
     )
  {
    return 0;
  }

  /* put card in trans state */
  if (prv_set_trans_state(pdev) != _NO_ERROR)
  {
    uart_string_write("Could not put card in trans state \r\n");
    return FR_DISK_ERR;
  }

  /* set number of bytes to read */
  MCI->bytcnt = cbRead;

  /* if high capacity card use block indexing */
  if (pdev->card_type & CARD_TYPE_HC)
    index = start_block;
  else
    index = start_block << 9;

#ifdef USE_DMA

  /* setup DMA channel */
  dmaregs->channel[dmach].source = (UNS_32) & MCI->data;

  dmaregs->channel[dmach].destination = lpc31xx_va_to_pa(buffer);

  dmaregs->channel[dmach].length = (cbRead >> 4) - 1;
  dmaregs->channel[dmach].config = (DMA_CFG_TX_BURST |
                                    DMA_CFG_RD_SLV_NR(20));

  /* enable DMA channel interrupts and start DMA */
  dmaregs->irq_mask &= ~(0x1 << (2 * dmach));
  dmadone = 0;

  dmaregs->channel[dmach].enable = 1;

#endif
  /* check how many blocks to read */
  if (end_block - 1 ==  start_block)
  {
    mci_execute_command(pdev, CMD_READ_SINGLE, index,
                        MCI_INT_CMD_DONE | MCI_INT_DATA_OVER | MCI_INT_RXDR);

