siredmar/master/Recherche/EA313x/lpc3xxx_cdl/csps/lpc313x/source/lpc313x_mci_driver.c
  }
  else
  {
    /* do read multiple */
    mci_execute_command(pdev, CMD_READ_MULTIPLE, index,
                        MCI_INT_CMD_DONE | MCI_INT_DATA_OVER | MCI_INT_RXDR);

  }

  if (pdev->status != 0)
  {
    uart_string_write("Error with sending command \r\n");
    return _ERROR;
  }

#ifdef USE_DMA
  while (!dmadone);

  //lpc31xx_force_cache_coherence(buffer, (UNS_32 *)((char*)buffer + cbRead));
  lpc31xx_invalidate_dcache_range(buffer, (UNS_32 *)((char*)buffer + cbRead));

  /* Disable channel */
  dmaregs->irq_mask |= (0x1 << (2 * dmach));
  dmaregs->channel[dmach].enable = 0;

  return cbRead;
#endif

  /* read data from the FIFO */
#ifdef POLL

  if (pdev->status == 0)
    cbRead = prv_pull_data(pdev, (UNS_8*)buffer, cbRead);
  else
    cbRead = 0; /* return error if command fails */
  return cbRead;

#else
#ifndef USE_DMA
  dto = 0;
  if (pdev->status == 0)
  {
    while (Read != cbRead)
    {
      while (!rxdr);
      Read += prv_pull_fifo(pdev, (UNS_8*)buffer + Read);
      rxdr = 0;
      MCI->intmsk |= MCI_INT_RXDR;
    }
    while (!dto);
    Read += prv_pull_fifo(pdev, (UNS_8*)buffer + Read);
  }
  else
    Read = 0;

  return Read;
#endif
#endif

}

/***********************************************************************
 *
 * Function: mci_write_blocks
 *
 * Purpose: Performs write of data to the SD/MMC card
 *
 * Processing:
 *     Write the requested blocks in sequence with data passed.
 *
 * Parameters:
 *     devid:     Pointer to card info structure
 *     buffer:    Pointer to data buffer to copy to
 *     start_block: Start block number
 *     end_block: End block number
 *
 * Outputs: None
 *
 * Returns: Number of bytes actually written
 *
 * Notes:
 *  To write single block set start_block = end_block.
 *
 **********************************************************************/
INT_32 mci_write_blocks(INT_32 devid,
                        void* buffer,
                        INT_32 start_block,
                        INT_32 end_block)
{
  MCI_CARD_INFO_T* pdev = (MCI_CARD_INFO_T*) devid;
  /*(end_block - start_block) * 512 */
  INT_32 cbWrote = (end_block - start_block) << 9;
  INT_32 index;
#ifndef USE_DMA
  INT_32 Wrote = 0;
#endif

  /* if card is not acquired return immediately */
  if ((prv_card_acquired(pdev) == FALSE)
      || (end_block < start_block) /* check block index in range */
      || (start_block < 0)
      || (end_block > pdev->blocknr)
     )
  {
    uart_string_write("Card is not acquired ! \r\n");
    return FR_DISK_ERR;
  }

  /* put card in trans state */
  if (prv_set_trans_state(pdev) != _NO_ERROR)
  {
    uart_string_write("Could not put card in trans state \r\n");
    return FR_DISK_ERR;
  }

  /* set number of bytes to write */
  MCI->bytcnt = cbWrote;

  /* if high capacity card use block indexing */
  if (pdev->card_type & CARD_TYPE_HC)
    index = start_block;
  else
    index = start_block << 9;

#ifdef USE_DMA

  lpc31xx_force_cache_coherence(buffer, (UNS_32 *)((char*)buffer + cbWrote));

  /* setup DMA channel */
  dmaregs->channel[dmach].destination = (UNS_32) & MCI->data;
  dmaregs->channel[dmach].source = lpc31xx_va_to_pa(buffer);

  dmaregs->channel[dmach].length = (cbWrote >> 4) - 1;

  dmaregs->channel[dmach].config = (DMA_CFG_TX_BURST |
                                    DMA_CFG_WR_SLV_NR(20));

  /* enable DMA channel interrupts and start DMA */
  dmaregs->irq_mask &= ~(0x1 << (2 * dmach));
  dmadone = 0;

  dmaregs->channel[dmach].enable = 1;

#endif

  /* check how many blocks to write */
  if (end_block - 1 == start_block)
  {
    mci_execute_command(pdev, CMD_WRITE_SINGLE, index,
                        MCI_INT_CMD_DONE | MCI_INT_TXDR);
  }
  else
  {
    /* do write multiple */
    mci_execute_command(pdev, CMD_WRITE_MULTIPLE, index,
                        MCI_INT_CMD_DONE | MCI_INT_TXDR);
  }

#ifdef USE_DMA
  while (!dmadone);

  /* Disable channel */
  dmaregs->irq_mask |= (0x1 << (2 * dmach));
  dmaregs->channel[dmach].enable = 0;

  return cbWrote;
#endif

#ifdef POLL

  /* write data to the FIFO */
  if (pdev->status == 0)
  {
    prv_push_data((UNS_8*)buffer, cbWrote);
    /* wait for transfer done */
    prv_wait_for_completion(pdev, MCI_INT_DATA_OVER);
  }
  else
    cbWrote = 0;

  return cbWrote;

#else

#ifndef USE_DMA
  dto = 0;
  if (pdev->status == 0)
  {

    while (Wrote != cbWrote)
    {
      while (!txdr);
      Wrote += prv_push_fifo((UNS_8*)buffer + Wrote, 128);
      txdr = 0;
      MCI->intmsk |= MCI_INT_TXDR;
    }
    while (!dto);
  }
  else
    Wrote = 0; /* return error if command fails */

  return Wrote;
#endif
#endif
}

